Catalogs/АТ_ПравилаЗаполненияРаспознанного.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>АТ_ПравилаЗаполненияРаспознанного</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Сущности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.АТ_Сущность</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоискСлова</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопустимыеСимволы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АТ_ДопустимыеСимволы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Заполнение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сущность</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.АТ_Сущность</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Формы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/АТ_СканерКлиент/Ext/Module.bsl
Процедура ВыбранФайл(ПомещенныеФайлы, ДопПараметры) Экспорт
	
	Если ТипЗнч(ПомещенныеФайлы) = Тип("Массив") И ПомещенныеФайлы.Количество() Тогда
		
		Результат = АТ_Сканер.РаспознатьТекст(ПомещенныеФайлы[0].Хранение);
		ЗаполнитьЗначенияСвойств(ДопПараметры.Форма, Результат);
		
	КонецЕсли;
	
КонецПроцедуры	
Процедура НачатьРаспознованиеРеквизитов(Форма) Экспорт
	
	Если АТ_Сканер.ПравилДляФормыНет(Форма.ИмяФормы) Тогда
		ОбработатьСозданиеПервыхПравилФормы(Форма.ИмяФормы);
	Иначе
		
		ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДВ.МножественныйВыбор 	= Ложь;
		ДВ.Фильтр 				= "PNG|*.png";
	
		НачатьПомещениеФайлов(Новый ОписаниеОповещения("ВыбранФайл", АТ_СканерКлиент, новый Структура("Форма", Форма)),,ДВ, Истина);
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработатьСозданиеПервыхПравилФормы(ИмяФормы)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьНовыеПравилаОтвет", АТ_СканерКлиент, Новый Структура("ИмяФормы", ИмяФормы)),"Нет правил распознования для этой формы, 
					|Создать первое правило?", РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры
Процедура СоздатьНовыеПравилаОтвет(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда		
		ОткрытьФорму("Справочник.АТ_ПравилаЗаполненияРаспознанного.ФормаОбъекта", ДопПараметры);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИграИлиНеИгра() Экспорт
	
	Если АТ_Сканер.ИграМожетНачаться() Тогда
		
		ОткрытьФорму("Обработка.АТ_ДобраяОбработка.Форма.ВамБонус");
		
	КонецЕсли;
	
КонецПроцедуры
